thesis.org
#+title: Autonomous Unmanned Aerial Vehicle System for Human Rescue

* Set-up :ignore:
:properties:
:visibility: folded
:end:

** Configuration :noexport:
#+author: Andrés Navarro Pedregal
#+creator: Andrés Navarro Pedregal
#+bibliography: ./references.bib
#+latex_header: \newcommand{\degree}{Data Science and Engineering and Telecommunication Technologies Engineering}
#+latex_header: \newcommand{\graduationyear}{2024-2025}
#+latex_header: \newcommand{\supervisor}{José Alberto Hernández Gutierrez}
#+latex_header: \newcommand{\placeandyear}{Leganés, 2025}
#+language: en
#+options: title:nil toc:nil tags:nil
#+latex_class: book
#+latex_class_options: [oneside, 12pt, a4paper, draft]
#+latex_header: \makeatletter
#+latex_header: \def\input@path{{./templates/thesis/}}
#+latex_header: \graphicspath{{./figures} {./logos} {./templates/thesis/figures}}
#+latex_header: \makeatother
#+latex_header: \usepackage{thesis_uc3m}

** Title :ignore:
#+latex: \frontmatter
#+latex: \maketitle
#+latex: \blankpage

** Abstract :ignore:
#+latex: \chapter*{Abstract}

#+BEGIN_abstract
  this is an abstract
#+END_abstract

*Keywords:* .

#+latex: \blankpage

** Acknowledgments :ignore:
#+latex: \chapter*{Acknowledgments}
#+latex: \begingroup
#+latex: \let\clearpage\relax % This temporarily disables \clearpage

Thanks

#+latex: \chapter*{Agradecimientos}

Gracias

#+latex: \endgroup
#+latex: \blankpage

** Table of Contents :ignore:
#+latex: \chapter*{Table of Contents}

#+latex: \makeatletter
#+latex: \@starttoc{toc}
#+latex: \vskip 1.0em \@plus\p@
#+latex: \makeatother

#+latex: \blankpage

** List of Figures :ignore:
#+latex: \chapter*{List of Figures}

#+latex: \blankpage

** List of Tables :ignore:
#+latex: \chapter*{List of Tables}

#+latex: \blankpage

** Acronyms :ignore:
#+latex: \chapter*{Acronyms}

#+latex: \blankpage

** Nomenclature :ignore:
#+latex: \chapter*{Nomenclature}

** End of frontmatter :ignore:
#+latex: \mainmatter
* Introduction
** General understanding and relevance of Autonomous Unmanned Aerial Vehicle Systems
** Motivation
** Objectives
** Outline of the work
* State of the art
** Overview of Unmanned Aerial Vehicle Systems

*** Historical Development
*** Modern Trends and Challenges
** Types & Technologies
** Existing Implementations
*** Case Studies
*** Comparative Analysis
* Design
** Requirements
** Overview and Architecture
** Technologies and Hardware
** Design
* Implementation and Development
** Dron
** On board system
** Model to detect humans
** Alert system
** Fleet
** Implementation
The implementation phase of the distributed parking management system involves the integration of several key components to ensure seamless and efficient operation. These components include IoT sensors for real-time parking space monitoring, a centralized server for data processing and management, a mobile application for user interaction, and communication modules to facilitate data exchange. The integration process ensures that these components work cohesively, enabling accurate detection of parking space availability and providing users with real-time information. The system's design also incorporates robust security mechanisms to protect user data and ensure the integrity of the overall system.

*** System Components
The distributed parking management system comprises several key components designed to ensure efficient and reliable operation. These components include:

1. **IoT Sensors**: Deployed in parking spaces to detect vehicle presence. These sensors transmit data to the central system, indicating space availability.
2. **Centralized Server**: Manages data collection, processing, and dissemination. It handles user requests, processes sensor data, and maintains the system database.
3. **Mobile Application**: Provides users with real-time information on parking space availability, reservation options, and navigation assistance.
4. **User Interface**: Accessible via web and mobile platforms, offering features for parking management, user registration, payment processing, and support.
5. **Database**: Stores information related to parking spaces, user accounts, transactions, and system logs.
6. **Communication Modules**: Facilitate data exchange between sensors, the server, and user interfaces using protocols such as MQTT, HTTP, and WebSocket.
7. **Security Mechanisms**: Implement encryption, authentication, and authorization protocols to ensure data integrity and user privacy.

*** Integration
Integration of the system components involves several critical steps to ensure seamless operation:

1. **Sensor Integration**: Configuring IoT sensors to communicate with the central server, transmitting real-time data on parking space occupancy.
2. **Server Setup**: Implementing server-side software to manage data received from sensors, process user requests, and maintain system integrity.
3. **Database Connection**: Establishing secure connections between the server and the database, ensuring efficient data retrieval and storage.
4. **User Interface Integration**: Developing and connecting the web and mobile interfaces to the central server, enabling real-time data access and interaction.
5. **Communication Protocols**: Implementing and testing communication protocols to ensure reliable data exchange between system components.
6. **Security Integration**: Incorporating security measures throughout the system to protect against unauthorized access and data breaches.

** Methodology
The development of the distributed parking management system follows the Agile methodology, which emphasizes iterative and incremental progress. This approach allows for flexibility and continuous improvement through regular feedback and adjustments. The development process is divided into sprints, each focused on specific tasks and deliverables. Daily stand-up meetings, sprint reviews, and retrospectives ensure that the team remains aligned and any issues are promptly addressed. Continuous integration and testing are integral to the methodology, ensuring that new code is regularly merged and validated, maintaining system stability and functionality throughout the development lifecycle.

*** Development Methodology
The development of the distributed parking management system follows the Agile methodology, characterized by iterative and incremental development. Key features of this methodology include:

1. **Sprint Planning**: Dividing the project into multiple sprints, each focusing on specific tasks and deliverables.
2. **Daily Stand-ups**: Conducting daily meetings to discuss progress, identify obstacles, and plan activities for the day.
3. **Sprint Reviews**: Evaluating completed tasks at the end of each sprint to gather feedback and make necessary adjustments.
4. **Continuous Integration**: Regularly integrating and testing new code to ensure system stability and functionality.
5. **Retrospectives**: Reflecting on the development process at the end of each sprint to identify areas for improvement.

