thesis.tex
% Created 2024-07-23 Tue 09:44
% Intended LaTeX compiler: pdflatex
\documentclass[oneside, 12pt, a4paper, draft]{book}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\newcommand{\degree}{Data Science and Engineering and Telecommunication Technologies Engineering}
\newcommand{\graduationyear}{2024-2025}
\newcommand{\supervisor}{José Alberto Hernández Gutierrez}
\newcommand{\placeandyear}{Leganés, 2025}
\makeatletter
\def\input@path{{./templates/thesis/}}
\graphicspath{{./figures} {./logos} {./templates/thesis/figures}}
\makeatother
\usepackage{thesis_uc3m}
\author{Andrés Navarro Pedregal}
\date{\today}
\title{Autonomous Unmanned Aerial Vehicle System for Human Rescue}
\hypersetup{
 pdfauthor={Andrés Navarro Pedregal},
 pdftitle={Autonomous Unmanned Aerial Vehicle System for Human Rescue},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Andrés Navarro Pedregal}, 
 pdflang={English}}
\usepackage{biblatex}
\addbibresource{./references.bib}
\begin{document}

\frontmatter
\maketitle
\blankpage
\chapter*{Abstract}

\begin{abstract}
this is an abstract
\end{abstract}

\textbf{Keywords:} .

\blankpage
\chapter*{Acknowledgments}
\begingroup
\let\clearpage\relax % This temporarily disables \clearpage

Thanks

\chapter*{Agradecimientos}

Gracias

\endgroup
\blankpage
\chapter*{Table of Contents}

\makeatletter
\@starttoc{toc}
\vskip 1.0em \@plus\p@
\makeatother

\blankpage
\chapter*{List of Figures}

\blankpage
\chapter*{List of Tables}

\blankpage
\chapter*{Acronyms}

\blankpage
\chapter*{Nomenclature}
\mainmatter
\part{Introduction}
\label{sec:org88f51ca}
\chapter{General understanding and relevance of Autonomous Unmanned Aerial Vehicle Systems}
\label{sec:org737ee99}
\chapter{Motivation}
\label{sec:org8b85966}
\chapter{Objectives}
\label{sec:org05efed8}
\chapter{Outline of the work}
\label{sec:orga816359}
\part{State of the art}
\label{sec:org852bda4}
\chapter{Overview of Unmanned Aerial Vehicle Systems}
\label{sec:org2087377}

\section{Historical Development}
\label{sec:org197c0a5}
\section{Modern Trends and Challenges}
\label{sec:org3dcc1bc}
\chapter{Types \& Technologies}
\label{sec:org659468c}
\chapter{Existing Implementations}
\label{sec:orgaac826e}
\section{Case Studies}
\label{sec:org67814b0}
\section{Comparative Analysis}
\label{sec:org70a7c5a}
\part{Design}
\label{sec:org4707efc}
\chapter{Requirements}
\label{sec:org51d36db}
\chapter{Overview and Architecture}
\label{sec:org51d2824}
\chapter{Technologies and Hardware}
\label{sec:org1a7a91b}
\chapter{Design}
\label{sec:orga621620}
\part{Implementation and Development}
\label{sec:org5f63915}
\chapter{Dron}
\label{sec:org7a5ab64}
\chapter{On board system}
\label{sec:org028ea70}
\chapter{Model to detect humans}
\label{sec:orge8d56a1}
\chapter{Alert system}
\label{sec:orgd2a67c9}
\chapter{Fleet}
\label{sec:org1ef5aa8}
\chapter{Implementation}
\label{sec:org180e2c8}
The implementation phase of the distributed parking management system involves the integration of several key components to ensure seamless and efficient operation. These components include IoT sensors for real-time parking space monitoring, a centralized server for data processing and management, a mobile application for user interaction, and communication modules to facilitate data exchange. The integration process ensures that these components work cohesively, enabling accurate detection of parking space availability and providing users with real-time information. The system's design also incorporates robust security mechanisms to protect user data and ensure the integrity of the overall system.
\section{System Components}
\label{sec:org781fe7b}
The distributed parking management system comprises several key components designed to ensure efficient and reliable operation. These components include:

\begin{enumerate}
\item \textbf{\textbf{IoT Sensors}}: Deployed in parking spaces to detect vehicle presence. These sensors transmit data to the central system, indicating space availability.
\item \textbf{\textbf{Centralized Server}}: Manages data collection, processing, and dissemination. It handles user requests, processes sensor data, and maintains the system database.
\item \textbf{\textbf{Mobile Application}}: Provides users with real-time information on parking space availability, reservation options, and navigation assistance.
\item \textbf{\textbf{User Interface}}: Accessible via web and mobile platforms, offering features for parking management, user registration, payment processing, and support.
\item \textbf{\textbf{Database}}: Stores information related to parking spaces, user accounts, transactions, and system logs.
\item \textbf{\textbf{Communication Modules}}: Facilitate data exchange between sensors, the server, and user interfaces using protocols such as MQTT, HTTP, and WebSocket.
\item \textbf{\textbf{Security Mechanisms}}: Implement encryption, authentication, and authorization protocols to ensure data integrity and user privacy.
\end{enumerate}
\section{Integration}
\label{sec:orga350ec4}
Integration of the system components involves several critical steps to ensure seamless operation:

\begin{enumerate}
\item \textbf{\textbf{Sensor Integration}}: Configuring IoT sensors to communicate with the central server, transmitting real-time data on parking space occupancy.
\item \textbf{\textbf{Server Setup}}: Implementing server-side software to manage data received from sensors, process user requests, and maintain system integrity.
\item \textbf{\textbf{Database Connection}}: Establishing secure connections between the server and the database, ensuring efficient data retrieval and storage.
\item \textbf{\textbf{User Interface Integration}}: Developing and connecting the web and mobile interfaces to the central server, enabling real-time data access and interaction.
\item \textbf{\textbf{Communication Protocols}}: Implementing and testing communication protocols to ensure reliable data exchange between system components.
\item \textbf{\textbf{Security Integration}}: Incorporating security measures throughout the system to protect against unauthorized access and data breaches.
\end{enumerate}
\chapter{Methodology}
\label{sec:org71de2d9}
The development of the distributed parking management system follows the Agile methodology, which emphasizes iterative and incremental progress. This approach allows for flexibility and continuous improvement through regular feedback and adjustments. The development process is divided into sprints, each focused on specific tasks and deliverables. Daily stand-up meetings, sprint reviews, and retrospectives ensure that the team remains aligned and any issues are promptly addressed. Continuous integration and testing are integral to the methodology, ensuring that new code is regularly merged and validated, maintaining system stability and functionality throughout the development lifecycle.
\section{Development Methodology}
\label{sec:org9030bc3}
The development of the distributed parking management system follows the Agile methodology, characterized by iterative and incremental development. Key features of this methodology include:

\begin{enumerate}
\item \textbf{\textbf{Sprint Planning}}: Dividing the project into multiple sprints, each focusing on specific tasks and deliverables.
\item \textbf{\textbf{Daily Stand-ups}}: Conducting daily meetings to discuss progress, identify obstacles, and plan activities for the day.
\item \textbf{\textbf{Sprint Reviews}}: Evaluating completed tasks at the end of each sprint to gather feedback and make necessary adjustments.
\item \textbf{\textbf{Continuous Integration}}: Regularly integrating and testing new code to ensure system stability and functionality.
\item \textbf{\textbf{Retrospectives}}: Reflecting on the development process at the end of each sprint to identify areas for improvement.
\end{enumerate}
